---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.SymbolFamilyAndTypeNamesParam
source: html/faf7392b-b8fb-fc36-8428-245fe3d095ff.htm
---
# Autodesk.Revit.DB.ParameterTypeId.SymbolFamilyAndTypeNamesParam Property

"Family and Type"

## Syntax (C#)
```csharp
public static ForgeTypeId SymbolFamilyAndTypeNamesParam { get; }
```